package com.epam.thread.tunnel;
/*Разработать консольное многопоточное приложение.
Использовать возможности, предоставляемые пакетом java.util.concurrent.
Все сущности, желающие получить доступ к ресурсу, должны быть потоками.
Тоннель. В горах существует два железнодорожных тоннеля, по которым поезда могут двигаться в обоих направлениях.
По обоим концам тоннеля собралось много поездов. Обеспечить безопасное прохождение тоннелей в обоих направлениях.
Поезд можно перенаправить из одного тоннеля в другой при превышении заданного времени ожидания на проезд.*/


public class Tunnel{



    public Tunnel() {
    }

}


